export const firstNames = [
    "Άνταμ", "Άλμπιν", "Άλφρεντ", "Άλμα", "Άλβαρ", "Άλβε", "Αμίρ", "Άννα", "Αντώνης",
    "Άρον", "Άστριντ", "Άουγκουστ", "Άξελ", "Βενιαμίν", "Μπιλ", "Μπγιόρν", "Τσάρλι", "Χριστίνα",
    "Κάσπερ", "Δάντης", "Έμπα", "Έμπι", "Εδουάρδος", "Ηλίας", "Ελίνα", "Έλι", "Έμμα", "Έμιλ",
    "Έρικ", "Εύα", "Φίλιππος", "Φόλκε", "Φρανς", "Γαβριήλ", "Γκούσταβ", "Χάνα", "Χάρι", "Χένρι",
    "Χιάλμαρ", "Χούγκο", "Ίβαρ", "Τζακ", "Γιάν", "Γιόχαν", "Γιόελ", "Τζούλιαν", "Κάριν", "Καρλ",
    "Κερστίνα", "Κιάν", "Κνουτ", "Λαρς", "Λέβι", "Λίαμ", "Λένα", "Λέο", "Λεόν", "Λίλι", "Λίνα",
    "Λινέα", "Λίζα", "Λίβα", "Λόκε", "Λόβε", "Λούκας", "Λούντβιχ", "Λούκας", "Λούνα", "Μαντλέιν",
    "Μάλτε", "Μαρία", "Μαρί", "Ματέο", "Μαξ", "Μέλκερ", "Μέλβιν", "Μιχαήλ", "Μίλαν", "Μίλο",
    "Μίλτον", "Νίλς", "Νοέλ", "Ομάρ", "Όλιβερ", "Όλλε", "Ότις", "Όττο", "Όσκαρ", "Περ", "Πέτρος",
    "Φίλιππος", "Σαμ", "Σάρα", "Σίγκε", "Σίξτεν", "Σοφία", "Θεό", "Θωμάς", "Βάλτερ", "Βέρα",
    "Βίγκο", "Βίνσεντ", "Γουίλιαμ", "Βίλχελμ", "Βάλτερ", "Ξαβιέ", "Υλβά", "Άκε"
];

export const lastNames = [
    "Αμπραχαμσον", "Αχμέτ", "Άλι", "Αντρέασσον", "Άρβιντsson", "Άξελσον", "Μπένγκτσον", "Μπέργκερ",
    "Μπέργκγκρεν", "Μπέργκκβιστ", "Μπέργκμαν", "Μπέργκστρομ", "Μπλομ", "Μπλόμπεργκ", "Μπλομκβιστ",
    "Μπλομκβιστ", "Μπγιόρκ", "Μπγιόρκλουντ", "Μπγιόρνσον", "Κλάεσσον", "Ντάνιελσον", "Ντάλμπεργκ",
    "Έκ", "Έκμπεργκ", "Έκμπλάντ", "Έκχολμ", "Έκστρομ", "Ελιασσον", "Ένγκστρομ", "Έρικσον", "Έκλουντ",
    "Φάλμπεργκ", "Φρεντρίκσον", "Φρανσόν", "Φράντσεν", "Φρικ", "Γκούνναρσον", "Γκουστάφσον", "Γκιλενχαλ",
    "Χάλμπεργκ", "Χάνσον", "Χέντμπεργκ", "Χέλστρεμ", "Χενρίκσον", "Χερμάνσον", "Χολμπεργκ", "Χόλγκρεν",
    "Χόλμκβιστ", "Χούλτεν", "Χάγκ", "Χέλστρεμ", "Γιάκομπσον", "Γιάνσον", "Γιοχάνσον", "Γιόνσον",
    "Γιόνσον", "Κάρλσον", "Κλίντμπεργκ", "Κλίνγκμπεργκ", "Κλίντστρεμ", "Κνουτσσον", "Κρούγκερ", "Κούλμπεργκ",
    "Κούλεν", "Κούρκ", "Λάρσον", "Λίντμπεργκ", "Λίντμπλάντ", "Λίντέλ", "Λίντγκρεν", "Λίντχολμ", "Λίντκβιστ",
    "Λίντνερ", "Λίντροος", "Λίντστρομ", "Λίντκβιστ", "Λίντστεν", "Λίντβαλ", "Λιούνγκμπεργκ", "Λιούνγκγκρεν",
    "Λεύγκρεν", "Λούντμπεργκ", "Λούντγκρεν", "Λούντκβιστ", "Λούντμαρκ", "Λούντστρομ", "Μάγκνουσον",
    "Μάττσον", "Μάλμμπεργκ", "Μάλμγκρεν", "Μάλμκβιστ", "Μάλμστρομ", "Μάνσον", "Μαρτινσον", "Μελίν",
    "Μέλμπεργκ", "Μέλγκρεν", "Μέλκβιστ", "Μέλστρομ", "Μοχάμεντ", "Μολίν", "Μόλερ", "Μόρνερ",
    "Μόρτμπεργκ", "Μόρτεν", "Μόρτεντ", "Νόρμπεργκ", "Νόρντιν", "Νύμπεργκ", "Νύστρεμ", "Όλσον", "Ολόφσον",
    "Πέρσον", "Πέτερσον", "Πάλσον", "Σάντμπεργκ", "Σάντστρομ", "Σιόγκρεν", "Σιόμπεργκ", "Στρόμ",
    "Στρόμπεργκ", "Σούντμπεργκ", "Σούντστρομ", "Σούντερμπεργκ", "Τάγκε", "Βίκλουντ", "Γουάλιν", "Άμπεργκ",
    "Άκεσον", "Άστρεμ"
];

export const addresses = {
    "145 04": ["Μεγάλη Γέλια Οδός", "Βάγκο Λίνγεν", "Δ. Τοαστμάστεργκαταν"],
    "145 08": ["Εξαρτάται Από Τι Ψηφίζεις Οδός", "Μάρε Οδός", "Μάξ Οδός"],
    "145 09": ["Κινγκ Φάιντερ Οδός", "1p-γκρεντ", "Και Όχι, Δεν Έχω Ρυθμίσει Το Σαπούνι Στην Οδό"],
    "145 10": ["Γκάι Χάντερ Οδός", "Είναι Έτσι Οδός", "Έρχομαι Στις 22:00 Οδός"],
    "145 11": ["Όχι... Οδός", "Γκόρντον Ράμσεϊ Έρχεται Οδός", "Πάντα Με Κάποια Σχόλια Οδός"],
    "145 12": ["Μπα Ούου Οδό", "PT - Πόστον Τιχά Οδός", "NBK - Κατεστραμμένα Εσώρουχα Οδός"],
    "145 33": ["Κύριος Λεμόνι Οδός", "Κρύες Πατούσες Οδός", "Σίφτπ Οδός"],
    "145 34": ["LP Κάτω Από Χέρια Οδός", "Μπλου Βίζιον Οδός", "Αχ Στηβ Άβερυ Οδός"],
    "145 35": ["Μπλου Μπαλς Διοίκηση Οδός", "Γίνομαι Έξαλλος Οδός", "Με Γκούμαν Πλατεία"],
    "145 36": ["Μπροστά Οδός", "Αχ HB-Οδός", "Αχ Σωστά Οδός"],
    "145 37": ["Σοκολάτα Χαζούλη Οδός", "Μπύρα Στην Κόλα Οδός", "Αγριό Κόρμα Οδός"],
    "145 38": ["Να Βγω Σήμερα Ή Όχι Οδός", "Φούσκα Οδός", "Χαβ-Ράιντερ Οδός"],
    "145 39": ["Είναι Έτοιμο; Οδός", "Μεγάλη Νύχτα Οδός", "Αέρισε Ο Κύριος Οδός"],
    "145 40": ["Ω, 30 Γειτονιές Οδός", "Ποιο Φίλτρο Οδός", "Ράιν Μαν Οδός"],
    "145 41": ["PDF Στο Αυτό Οδός", "Βασιλιάς Οδός", "Κύριος Ποπκορν Οδός"],
    "145 42": ["Είναι Παρασκευή Οδός", "Θα Σταθεί Στο Βιβλίο Οδός", "Σοφία Οδός"],
    "145 43": ["Φοβάται Την Αλυσοειδή Σάγκα Οδός", "Σώθηκε Από Το Χριστό Οδός", "Χουντάι Χουντάι Αυτοκίνητο Οδός"],
    "145 44": ["Δεν Υπάρχει Πιο 80ς Από Αυτό Οδός", "Πάω Σπίτι Να Ραπάρουμε Οδός", "Καλά Ναι Οδός"],
    "145 45": ["Κινούμαι, Κινούμαι Οδός", "Σαλούν Γι Αλκοόλ Οδός", "Όταν Βγούμε Στην Πόλη Οδός"],
    "145 46": ["POSTNORD Οδός", "IRL Οδός", "Είναι ΠιΤζάμα Ή Οδός"],
    "145 47": ["Μπά Ρελλι Οδός", "Κινούμε Ένα Ρέι Οδός", "Ροστ Μαπλ Οδός"],
    "145 48": ["Όταν Βγει Το Νέο Άλμπουμ Οδός", "Όταν Μέρος 1 Οδός", "Μόντ-Ταρ Οδός"],
    "145 49": ["Τζέισον Μπέκερ Και Ο Μπαμπάς Οδός", "Η Μπύρα Στην Ψύξη Οδός", "Άχρηστη Οδός"],
    "145 50": ["Στην Αγγελία Οδός", "Πληρωμή Παρασκευή Οδός", "Βασιλιάς Μπύρας Οδός"],
    "145 51": ["Αχ Νάρα Οδός", "Πάντα Ξανθός Οδός", "PS4 Είναι Στο Οδός"],
    "145 52": ["Αυτός Κινεί Οδός", "Όταν Κάποιος Επισκέπτεται Στο Σπίτι Και Βάζει Τραγούδι Οδός", "Μία Καλή Μέρα Στο Οδός"],
    "145 53": ["Πότε Θα Πιούμε Την Πρώτη Μπύρα; Οδός", "Προτίνω Οδός", "Μναα Οδός"],
    "145 54": ["Φύγε Οδός", "Αγαπώ Το Πρόγραμμα Οδός", "Εεεεεεεε Οδός"],
    "145 55": ["Σούπερ Μάρκετ Τώρα Οδός", "Με Το Χέρι Στην Κουζίνα Οδός", "Σπάω Γυαλιά Οδός"],
    "145 56": ["GB Οδός", "BB Οδός", "EZ Ζωή Οδός"],
    "145 57": ["Με Γκούμαν Οδός", "Θα Καλέσω Την Εφορία Οδός", "Χάρπερμόντε Οδός"],
    "145 58": ["Βίνταλο Οδός", "Φορολογικές Εξαιρέσεις Οδός", "Ο Σέραφινο Το Ενέκρινε; Οδός"],
    "145 59": ["Όχι Ευχαριστώ! Οδός", "Τι Λέει Η Πολυτέλεια Για Αυτό; Οδός", "Δεν Με Νιάζει Οδός"],
    "145 77": ["Θα Πάρω Μια Κούπα Οδός", "ΓΚΕΙ ΑΠΟΚΑΛΥΠΤΕΤΑΙ Οδός", "*CAPS LOCK* ΟΔΟΣ", "Combo Στιγμή"],
    "145 78": ["Ακατέργαστος Οδός", "Μεγάλη Νύχτα Οδός", "Αέρισε Ο Κύριος Οδός"],
};

export const defaultCity = "Στοκχόλμη";
export const defaultCounty = "Νόρσμποργκ";
export const defaultCountry = "Σουηδία";

export const otherCities = ["Βαγδάτη", "Νέα Υόρκη", "Ουppsλα", "Βέστερος"];
export const otherCountries = ["Αφρική", "Ινδία", "Ελλάδα", "Νιγηρία"];

export const messages = {
    labels: {
        name: "Όνομα",
        street: "Δρόμος",
        zipCode: "Ταχυδρομικός Κώδικας",
        county: "Νομός",
        location: "Τοποθεσία"
    },

    title: "Παιχνίδι Ταξινόμησης Ταχυδρομείων",
    headerTitle: "ΠΡΟΣΟΜΟΙΩΤΗΣ ΤΑΞΙΝΟΜΗΣΗΣ ΤΑΧΥΔΡΟΜΕΙΩΝ",
    instructions: "Ταξινόμησε τα γράμματα σύμφωνα με τα δύο τελευταία ψηφία του Ταχυδρομικού Κώδικα. Μπορείς να απολυθείς αν κάνεις πάρα πολλά λάθη, αν λήξει ο χρονοδιακόπτης ή αν σε πιάσουν να κλέβεις.",
    correctMessage: "Σωστό!",
    incorrectMessage: "Λάθος.",
    levelUpMessage: "Ανέβηκες επίπεδο! Καλώς ήρθες στο {level} Mode!",
    inhalePowderFoundMessage: "Βρήκες Σκόνη Εισπνοής!",
    cashFoundMessage: "Βρήκες ${amount}! Είναι power-up!",
    totalCashPocketedMessage: "Συνολικά Χρήματα στην Τσέπη: ${totalCash}",
    firedCaughtStealingMessage: "ΑΠΟΛΥΘΗΚΕΣ! Πιάστηκες να κλέβεις! Τελικό σκορ: {score} | Συνολικά Χρήματα στην Τσέπη: $0",
    firedOutOfTimeMessage: "ΑΠΟΛΥΘΗΚΕΣ! Πολύ αργά! Τελικό σκορ: {score} | Συνολικά Χρήματα στην Τσέπη: ${totalCash}",
    firedMistakesMessage: "ΑΠΟΛΥΘΗΚΕΣ! Έκανες πάρα πολλά λάθη! Τελικό σκορ: {score} | Συνολικά Χρήματα στην Τσέπη: ${totalCash}",

    scoreMessage: "Σκορ: {score} | Χρήματα: ${cash}",
    timerMessage: "Υπολειπόμενος χρόνος: {time} δευτερόλεπτα",
    elementalMessage: "Δηλητήριο: {poison} | Μέθη: {intoxication}",

    inhalePowderDialogMessage: "Αυτό το γράμμα περιέχει μια παράξενη λευκή σκόνη. Θέλεις να την εισπνεύσεις;",
    inhalePowderActionText: "Εισπνοή Σκόνης",
    inhalePowderCancelText: "Αρνήσου",
    declineInhalePowderMessage: "Αρνήθηκες την εισπνοή σκόνης.",

    stealCashDialogMessage: "Αυτό το γράμμα περιέχει χρήματα. Θέλεις να κλέψεις $${amount};",
    stealCashActionText: "Κλέψε Χρήματα",
    stealCashCancelText: "Αρνήσου",
    caughtStealingMessage: "Πιάστηκες να κλέβεις! Χρήματα στην τσέπη: $0",
    pocketCashMessage: "Πήρες ${amount} στην τσέπη σου",
    declineStealMessage: "Αρνήθηκες τα χρήματα.",
    outLabel: "ΕΞΩ",
    unknownZipCode: "???",
    outgoingLetterMessage: "Αυτό το γράμμα πρέπει να ταξινομηθεί ως ΕΞΩ",
};
